20240505T012745--kdoc-166-kdocは何ではない__essay.org
:properties:
:ID: 20240505T012745
:mtime:    20241102180322
:ctime:    20241028101410
:end:
#+title:      KDOC 166: KDOCは何ではない
#+date:       [2024-05-05 Sun 01:27]
#+filetags:   :essay:
#+identifier: 20240505T012745

* この文書のステータス
- 作成
  - [X] 2024-05-09 貴島
- レビュー
  - [X] 2024-05-11 貴島

* 概要
KDOCはツェッテルカステンライクな方法で構成されたドキュメントシリーズである。何ではないことを示すことで、何か、を明確にする。

- 百科事典ではない

  網羅を目的としていない。条件を満たす、関連する可能性のあるトピックだけを追加し、ノイズを増やさないようにする。また、一般性や中立性もない。自分の個人的な意見を書く。

- 日記ではない

  個人的な意見を書くといっても、単なる感想や感情を書く場所ではない。結論のある自分のアイデアを、誰でもわかるように説明しなければならない。

- コード置き場ではない

  いつか使うコード類を保存する場所ではない。それが便利なら、解説して文脈関係なく使えるようにしなければならない。

* 関連
- [[id:20231008T203658][KDOC 36: 『TAKE NOTES!』]]。ツェッテルカステンの参考にしている本
- [[id:20240204T105547][KDOC 71: KDOCエントリの書き方を考える]]。書き方に言及している
