20240505T012745--kdoc-166-kdocは何ではない__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:21Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 166: KDOCは何ではない</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 166: KDOCは何ではない</h1>
<div id="outline-container-orga3368cf" class="outline-2">
<h2 id="orga3368cf"><a href="#orga3368cf">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orga3368cf">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-09 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-11 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga366bd0" class="outline-2">
<h2 id="orga366bd0"><a href="#orga366bd0">概要</a></h2>
<div class="outline-text-2" id="text-orga366bd0">
<p>
KDOCはツェッテルカステンライクな方法で構成されたドキュメントシリーズである。何ではないことを示すことで、何か、を明確にする。
</p>

<ul class="org-ul">
<li><p>
百科事典ではない
</p>

<p>
網羅を目的としていない。条件を満たす、関連する可能性のあるトピックだけを追加し、ノイズを増やさないようにする。また、一般性や中立性もない。自分の個人的な意見を書く。
</p></li>

<li><p>
日記ではない
</p>

<p>
個人的な意見を書くといっても、単なる感想や感情を書く場所ではない。結論のある自分のアイデアを、誰でもわかるように説明しなければならない。
</p></li>

<li><p>
コード置き場ではない
</p>

<p>
いつか使うコード類を保存する場所ではない。それが便利なら、解説して文脈関係なく使えるようにしなければならない。
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgc6f2b83" class="outline-2">
<h2 id="orgc6f2b83"><a href="#orgc6f2b83">関連</a></h2>
<div class="outline-text-2" id="text-orgc6f2b83">
<ul class="org-ul">
<li><a href="20231008T203658--kdoc-36-『take-notes』__book.html#ID-20231008T203658">KDOC 36: 『TAKE NOTES!』</a>。ツェッテルカステンの参考にしている本</li>
<li><a href="20240204T105547--kdoc-71-kdocエントリの書き方を考える__essay.html#ID-20240204T105547">KDOC 71: KDOCエントリの書き方を考える</a>。書き方に言及している</li>
</ul>
</div>
</div>
<div id="outline-container-org4da7873" class="outline-2">
<h2 id="org4da7873"><a href="#org4da7873">Backlinks</a></h2>
<div class="outline-text-2" id="text-org4da7873">
<ul class="org-ul">
<li><a href="./20240504T224810--kdoc-165-メモの課題と対応策を考える__structure.html">KDOC 165: メモの課題と対応策を考える</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
